let a = [0, 1, 2, 3, 4, 5, 8]; // Создан массив с числами
console.log(a[4]); // Вывести на экран 5 элемент

let b = Array(0, 1, 2, 3, 4, 5); // b = [0,1,2,3,4,5]
console.log(b[4]); // Вывести на экран 5 элемент

b[6] = 8; // b = [0,1,2,3,4,5,8]

let c = []; // Создать пустой массив
c[78] = "abc"; // Записать в 79 элемент абц
c[79] = 34; // Записать в 80 элемент 34
c[80] = false; // Записать фолс в 81 элемент
c[44] = []; // пустой массив в массиве
console.log(c); // вывести на экран маасив ц
console.log(c[0], c[44]); // вывести первый и 45 элементы

console.log(a.length, b.length, c.length, c[0]); // Вывести на экран а б и ц массивы а также первый элемент ц
x = c[7] + a[0]; // Икс равно 8 элемент Ц плюс первый элемент А

console.log(x); // Вывести на экран Икс

const min = 50, max = 100, n = 5; // 5 элементов со случайными числами от 50 до 100

for (let i = 0; i < n; i++) { // Начать цикл с И равное 0 проверять до тех пор пока И меньше Н и проверять каждое число
    a[i] = Math.floor(Math.random() * (max - min + 1)) + min; // а итое со случайными числами
}
console.log(a); // вывести на экран массив

let str = ""; // пустая запись
for (let i = 0; i < a.length - 1; i++) { // и от 0 до последнего элемента проверять все элементы
    str = str + a[i] + ", "; // Совместить вместе пустую запись А Итое и пробел для корректного отображения
}
str = str + a[a.length - 1]; // вывести последний элемент массива
console.log(str); // Вывести СТР на тобишь вывести последний элемент массива

let d = [], count = 0, j; // д - пустой массив коунт равный 0 и J - переменные
for (j = 0; j < n; j++) { // начать цикл с джи равной 0 прооверять до того момента пока Джи меньше Н и проверять каждый элемент
    d[j] = Math.floor(Math.random() * (max - min + 1)) + min; // Д дже воспроизвести в виде случайного числа
}
console.log(d, j, d[j - 1]); // Вывести на экран Д Джей и последний элемент массива

for (let i = 0; i < d.length; i++) {
    if (d[i] % 2 == 0) { // Если Д итое делися без остатка на два
        count++; // сложить коунт
    }
}
console.log("Количество четных элементов в массиве равно " + count); // Вывести на экран чётные элементы массива

let maxElement = d[0]; // предполагаем что д0 максимальный элемент массива
for (let i = 1; i < d.length; i++) { // Начинаем проверять числа начиная с первого элемента до и меньше длинны массива
    if (d[i] > maxElement) { // Если д Итое больше максЭленет
        maxElement = d[i]; // То меняем максимальный элемент на д Итое
    }
}
console.log("Максимальный элемент равен " + maxElement); // Вывод на экран максимального элемента

let minElement = d[0]; // предполагаем что минимальный элемент д0
for (let i = 1; i < d.length; i++) { // проверять И начиная с 1 до тех пор пока И меньше длины массива и провеерять каждый элемент
    if (d[i] < minElement) { // Если Д Итое меньше Минимального элемента
        minElement = d[i]; // Считать Д итое минимальным элементом
    }
}
console.log("Минимальный элемент равен " + minElement); // Вывести на экран минимальный элемент

let sum = 0; // переменная СУМ равная 0
for (let i = 0; i < d.length; i++) { // проверять И начиная с 0 проверять до тех пор пока И меньше длины массива проверять каждый элемент
    sum += d[i] // Сум равно сложенное Д итое
}
console.log("Среднее арифмитическое элементов равно " + (sum / (d.length))); // вывести среднее арифметическое элементов массива

let reverse = []; // пустой массив
for (let k = 0, i = d.length - 1; k < d.length; k++, i--) { // Цикл с К равное 0 считать до последнего элемента массива проверять каждый элемент К И - не понимаю что за зверь
    reverse[k] = d[i]; //reverse[k] = d[n-1-k];
}
console.log(d, reverse); // Вывести на экран Д и пустой массив