<<<<<<< HEAD
a = 6;
b = 5;
c = 3;
if (a + b <= c){
    console.log("Треугольник - невозможен!");
}
else if (a + c <= b) {
    console.log("Треугольник - невозможен!");
}
else if (b + c <= a) {
    console.log("Треугольник - невозможен!");
}
else{
    console.log("Исходя из данных параметров, тругольник получить - реально!");
=======
a = 6;
b = 5;
c = 3;
if (a + b <= c){
    console.log("Треугольник - невозможен!");
}
else if (a + c <= b) {
    console.log("Треугольник - невозможен!");
}
else if (b + c <= a) {
    console.log("Треугольник - невозможен!");
}
else{
    console.log("Исходя из данных параметров, тругольник получить - реально!");
>>>>>>> ea76e2b31cba1c12c47c7c491140af1b1ad89226
}