const React = require("react");

const About = () => {

    return <>
    <div class="about_app">
        <p>Меня зовут Дмитрий, это мой финальный проект на курсе Front-End разработки, представляющий из себя приложение по учёту расхода денежных средств, которое поможет вам не уходить в "Минус", и всегда быть в осведомлённым в собственных тратах, данное приложение не имеет аналогов в Рунете, и на мой собственный взгляд является "Панацеей" в экономии, хотя бы потому, что я им пользуюсь лично, и ни один финансовый менеджер не давал столь чёткого видинья в экономии финансов.</p>
    </div>
    </>
}

module.exports = About;