/*
 * PRODUСT_ADD - добавить продукт
 * PRODUCT_DELETE - удалить продукт
 * PRODUCT_EDIT - редактировать продукт
 */ 
/*Экшены — это структуры, которые передают данные из вашего приложения в стор.*/ 
/*Они являются единственными источниками информации для стора*/

const addPost = (post) => { // Переменная addPost
    return {
        type: "POST_ADD", /*Экшены должны иметь поле type, которое указывает на тип исполняемого экшена. Типы должны быть, как правило, заданы, как строковые константы.*/
        post /*Повторяет то что написано в скобках*/
    }
}

const deletePost = (postId) => {
    return {
        type: "POST_DELETE", /*Экшены должны иметь поле type, которое указывает на тип исполняемого экшена. Типы должны быть, как правило, заданы, как строковые константы.*/
        postId /*Посты удаляем по id поэтому передаваться должен id*/
    }
}

const likePlus = (postId) => {
    return {
        type: "LIKE_PLUS",
        postId
    }
}

module.exports = {addPost, deletePost, likePlus}